# GetDisplacedElementIdsFromAllChildren Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..GetDisplacedElementIdsFromAllChildren Method
DisplacementElement Class See Also
---
The element ids of elements displaced by this DisplacementElement and any DisplacementElement which declare this one as parent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> GetDisplacedElementIdsFromAllChildren()
```

Visual Basic
---
```text
Public Function GetDisplacedElementIdsFromAllChildren As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetDisplacedElementIdsFromAllChildren()
```

# ### Return Value
The element ids.
# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace